/**********************************************************************************
 *** тоглогчийн ээлжийг хадаглах хувьсагч нэгдүүгэр тоглогч 0 хоёрдугаар тоглогч 1.
 *********************************************************************************/
var activePlayer = 0;

/**********************************************************************************
 ***тоглогчидийн тоглосн оноог цуглуулах хувьсагч.
 *********************************************************************************/

var Scorres = [0, 0];

/**********************************************************************************
 ***тоглогчийн ээлжиндээ цуглууах хувьсагч.
 *********************************************************************************/

var roundScore = 0;

/***********************************************************************************************************
 ***шоо аль талаарай буусаныг хадаглах хувьсагч хадаглах 1-6 гэсэн утыг хувсагчид санамсаргүйгээр үүсэж өгнө.
 **********************************************************************************************************/
//Шооны дурын тоо өгнө.
var diceNumber = Math.floor(Math.random() * 6) + 1;

/*********************************************************************************************************
 ***DOM хандалд олон DOM бичвэл tree болно querySelector# байж болно харин илүү хурдан гэвэл getElementById.
 *********************************************************************************************************/

document.getElementById("score-0").textContent = "0";
document.getElementById("score-1").textContent = "0";
document.getElementById("current-1").textContent = "0";
document.getElementById("current-0").textContent = "0";
//Шооны зурагыг харуулахгүй
var diceDom = document.querySelector(".dice");
diceDom.style.display = "none";

/**********************************************************************************
 ***Дурийн тоо өгөх буюу Roll dice ажиллуулах anonymous функц болон callback функц.
 *********************************************************************************/
document.querySelector(".btn-roll").addEventListener("click", function() {
  //Шооны дурын тоо өгнө.
  var diceNumber = Math.floor(Math.random() * 6) + 1;
  //Шооны зургыг гаргаж өгнө.
  diceDom.style.display = "block";
  //Буусан санамсаргүй зургыг гаргаж ирнэ.
  diceDom.src = "dice-" + diceNumber + ".png";

  /**********************************************************************************
   ***Буусан тоо нь 1 ээс ялгаатай бол идэвхтэй тоглогчийн ээлжийн оноог шилжүүлнэ.
   *********************************************************************************/
  if (diceNumber !== 1) {
    //1-ээс ялгаатай тоо буулаа. буусан тоог нэмж өгнө.
    roundScore = roundScore + diceNumber;
    document.getElementById("current-" + activePlayer).textContent = roundScore;
  } else {
    // 1 буусан тул тоглогчийн ээлжийг энэ хэсэгт сольж өгнө.
    //Энэ тоглогчийн ээлжийн цуглуусан оноог 0 болгоно.
    roundScore = 0;
    document.getElementById("current-" + activePlayer).textContent = 0;

    //Хэрэв идэвхтэй тоглогч нь 0 байвал идэвхтэй тологчийг 1 болго.
    //Үгүй бол идэвхтэй тоглогчийг 1 болго
    activePlayer === 0 ? (activePlayer = 1) : (activePlayer = 0);

    //Улаан цэгийг шилжүүлнэ. toggle бүх шилжүүлэх active-ийг.
    document.querySelector(".player-0-pцanel").classList.toggle("active");
    document.querySelector(".player-1-panel").classList.toggle("active");

    //Шоог түр алга болгох.
    diceDom.style.display = "none";

    // if(activePlayer === 0){
    //   activePlayer = 1
    // }else{
    //   activePlayer = 0
    // }
  }
});

/**********************************************************************************
 ***мэндилчилгээ.
 *********************************************************************************/

// var message =
//   "Cайн байна уу \nэнхүү тоглоом анхны туршилт болхоор та бүхэн минь ойлгоорэй.";
// alert(message);
