/**********************************************************************************
 *** тоглогчийн ээлжийг хадаглах хувьсагч нэгдүүгэр тоглогч 0 хоёрдугаар тоглогч 1
 *********************************************************************************/
var activePlayer = 0;

/**********************************************************************************
 ***тоглогчидийн тоглосн оноог цуглуулах хувьсагч
 *********************************************************************************/

var Scorres = [0, 0];

/**********************************************************************************
 ***тоглогчийн ээлжиндээ цуглууах хувьсагч
 *********************************************************************************/

var roundScore = 0;

/***********************************************************************************************************
 ***шоо аль талаарай буусаныг хадаглах хувьсагч хадаглах 1-6 гэсэн утыг хувсагчид санамсаргүйгээр үүсэж өгнө
 **********************************************************************************************************/

var dice = Math.floor(Math.random() * 6) + 1;

/**********************************************************************************
 ***DOM хандалд
 *********************************************************************************/

window.document.querySelector("#score-0").textContent = "0";
document.querySelector("#score-1").textContent = "0";
document.querySelector("#current-1").textContent = "0";
window.document.querySelector("#current-0").textContent = "0";

// document.querySelector(".dice").style.display = "none";

/**********************************************************************************
 ***мэндилчилгээ
 *********************************************************************************/

var message =
  "Cайн байна уу \nэнхүү тоглоом анхны туршилт болхоор та бүхэн минь ойлгоорэй.";
alert(message);
